In [14]:
import pandas as pd
import numpy as np
marks={'chemistry':[67,90,66,23],
         'physics':[45,92,72,40],
         'mathematics':[50,87,81,12],
         'english':[19,90,72,68]}
marks_df=pd.DataFrame(marks,index=['Subhodh','Ram','Abdul','John'])
marks_df

         chemistry  physics  mathematics  english
Subhodh         67       45           50       19
Ram             90       92           87       90
Abdul           66       72           81       72
John            23       40           12       68

In [15]:
marks_df['total']=marks_df['chemistry']+marks_df['physics']+marks_df['mathematics']+marks_df['english']
marks_df

         chemistry  physics  mathematics  english  total
Subhodh         67       45           50       19    181
Ram             90       92           87       90    359
Abdul           66       72           81       72    291
John            23       40           12       68    143

In [18]:
marks_df.drop(columns='total',inplace=True)
marks_df

         chemistry  physics  mathematics  english
Subhodh         67       45           50       19
Ram             90       92           87       90
Abdul           66       72           81       72
John            23       40           12       68

In [20]:
new_marks=marks_df+5
new_marks

         chemistry  physics  mathematics  english
Subhodh         72       50           55       24
Ram             95       97           92       95
Abdul           71       77           86       77
John            28       45           17       73

In [21]:
new_marks=marks_df+[5,10,20,2]
new_marks

         chemistry  physics  mathematics  english
Subhodh         72       55           70       21
Ram             95      102          107       92
Abdul           71       82          101       74
John            28       50           32       70

In [22]:
marks_df.apply(np.sum,axis=0)

chemistry      246
physics        249
mathematics    230
english        249
dtype: int64

In [23]:
marks_df.apply(np.sum,axis=1)

Subhodh    181
Ram        359
Abdul      291
John       143
dtype: int64

In [24]:
f=marks_df<35
marks_df.mask(f,'Fail')

        chemistry  physics mathematics english
Subhodh        67       45          50    Fail
Ram            90       92          87      90
Abdul          66       72          81      72
John         Fail       40        Fail      68